MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV46F256VLL16Q/mcu.h
/****************************************************************************
**
** Copyright (C) 2025 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __MKV46F256VLL16Q_H__
#define __MKV46F256VLL16Q_H__



//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************

#define NUMBER_OF_INT_VECTORS                   68               // Number of interrupts in the Vector table
#define NotAvail_IRQn                           -67              // Not available device specific interrupt
#define NonMaskableInterrupt_IRQn               -14              // Non-maskable Interrupt (NMI)
#define DMA0_IRQn                               0                // DMA channel 0, 16 transfer complete
#define DMA1_IRQn                               1                // DMA channel 1, 17 transfer complete
#define DMA2_IRQn                               2                // DMA channel 2, 18 transfer complete
#define DMA3_IRQn                               3                // DMA channel 3, 19 transfer complete
#define DMA4_IRQn                               4                // DMA channel 4, 20 transfer complete
#define DMA5_IRQn                               5                // DMA channel 5, 21 transfer complete
#define DMA6_IRQn                               6                // DMA channel 6, 22 transfer complete
#define DMA7_IRQn                               7                // DMA channel 7, 23 transfer complete
#define DMA8_IRQn                               8                // DMA channel 8, 24 transfer complete
#define DMA9_IRQn                               9                // DMA channel 9, 25 transfer complete
#define DMA10_IRQn                              10               // DMA channel 10, 26 transfer complete
#define DMA_Error_IRQn                          16               // DMA error interrupt channels 0-1531
#define MCM_Interrupt_IRQn                      17               // MCM interrupt
#define Command_Complete_IRQn                   18               // Command complete
#define Read_Collision_IRQn                     19               // Read collision
#define PMC_IRQn                                20               // Low-voltage detect, low-voltage warning
#define LLWU_IRQn                               21               // Low Leakage Wakeup
#define Both_Watchdog_Modules_Share_This_Interrupt_IRQn 22               // Both watchdog modules share this interrupt
#define I2C0_IRQn                               24               // I2C0
#define SPI0_IRQn                               26               // SPI0
#define UART0_RX_TX_IRQn                        31               // UART0 status sources
#define UART0_ERR_IRQn                          32               // UART0 error sources
#define UART1_RX_TX_IRQn                        33               // UART1 status sources
#define UART1_ERR_IRQn                          34               // UART1 error sources
#define ADCA_Scan_Complete_IRQn                 39               // ADCA Scan complete
#define CMP0_IRQn                               40               // CMP0
#define CMP1_IRQn                               41               // CMP1
#define FTM0_IRQn                               42               // FTM0 8 channels
#define FTM1_IRQn                               43               // FTM1 2 channels
#define LPTMR_IRQn                              58               // LPTMR
#define PORTA_IRQn                              59               // Pin detect (Port A)
#define PORTB_IRQn                              60               // Pin detect (Port B)
#define PORTC_IRQn                              61               // Pin detect (Port C)
#define PORTD_IRQn                              62               // Pin detect (Port D)
#define PORTE_IRQn                              63               // Pin detect (Port E)
#define Software_IRQn                           64               // Software
#define ENC_COMPARE_IRQn                        66               // ENC Compare
#define ENC_HOME_IRQn                           67               // ENC Home
#define ENC_Watchdog/Simultaneous_A_&_B_Change_IRQn 68               // ENC Watchdog/Simultaneous A & B change
#define ENC_INDEX_IRQn                          69               // ENC Index/Roll over/Roll Under
#define CMP2_IRQn                               70               // CMP2
#define FTM3_IRQn                               71               // FTM3 8 channels
#define ADCB_Scan_Complete_IRQn                 73               // ADCB Scan complete
#define CAN0_0Red_Message_buffer_IRQn           75               // FLexCAN0 OR'ed Message buffer (0-15)
#define CAN0_Bus_Off_IRQn                       76               // FLexCAN0 Bus Off
#define CAN0_Error_IRQn                         77               // FLexCAN0 Error
#define CAN0_Tx_Warning_IRQn                    78               // FLexCAN0 Transmit Warning
#define CAN0_Rx_Warning_IRQn                    79               // FLexCAN0 Receive Warning
#define CAN0_Wake_Up_IRQn                       80               // FLexCAN0 Wake Up
#define EFlExPWM_Submodule_0_Compare_IRQn       81               // eFlexPWM submodule 0 Compare
#define EFlExPWM_Submodule_0_Reload_IRQn        82               // eFlexPWM submodule 0 Reload
#define EFlExPWM_Submodule_1_Compare_IRQn       83               // eFlexPWM submodule 1 Compare
#define EFlExPWM_Submodule_1_Reload_IRQn        84               // eFlexPWM submodule 1 Reload
#define EFlExPWM_Submodule_2_Compare_IRQn       85               // eFlexPWM submodule 2 Compare
#define EFlExPWM_Submodule_2_Reload_IRQn        86               // eFlexPWM submodule 2 Reload
#define EFlExPWM_Submodule_3_Compare_IRQn       87               // eFlexPWM submodule 3 Compare
#define EFlExPWM_Submodule_3_Reload_IRQn        88               // eFlexPWM submodule 3 Reload
#define EFlExPWM_All_Input_Captures_IRQn        89               // eFlexPWM all input captures
#define EFlExPWM_Reload_Error_IRQn              90               // eFlexPWM reload error
#define EFlExPWM_Fault_IRQn                     91               // eFlexPWM Fault
#define CMP3_IRQn                               92               // CMP3
#define CAN1_0Red_Message_buffer_IRQn           94               // FLexCAN1 OR'ed Message buffer (0-15)
#define CAN1_Bus_Off_IRQn                       95               // FLexCAN1 Bus Off
#define CAN1_Error_IRQn                         96               // FLexCAN1 Error
#define CAN1_Tx_Warning_IRQn                    97               // FLexCAN1 Transmit Warning
#define CAN1_Rx_Warning_IRQn                    98               // FLexCAN1 Receive Warning
#define CAN1_Wake_Up_IRQn                       99               // FLexCAN1 Wake Up



//*****************************************************************************
//
// Port control and interrupts (PORT) registers
//
//*****************************************************************************

