MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV46F256VLL16Q/mcu.h
#define SIM_SOPT1                     (*((volatile uint32_t *)0x40047000))      // System Options Register 1 (SIM_SOPT1)
#define SIM_SOPT2                     (*((volatile uint32_t *)0x40048004))      // System Options Register 2 (SIM_SOPT2)
#define SIM_SOPT4                     (*((volatile uint32_t *)0x4004800C))      // System Options Register 4 (SIM_SOPT4)
#define SIM_SOPT5                     (*((volatile uint32_t *)0x40048010))      // System Options Register 5 (SIM_SOPT5)
#define SIM_SOPT7                     (*((volatile uint32_t *)0x40048018))      // System Options Register 7 (SIM_SOPT7)
#define SIM_SOPT8                     (*((volatile uint32_t *)0x4004801C))      // System Options Register 8 (SIM_SOPT8)
#define SIM_SOPT9                     (*((volatile uint32_t *)0x40048020))      // System Options Register 9 (SIM_SOPT9)
#define SIM_SDID                      (*((volatile uint32_t *)0x40048024))      // System Device Identification Register (SIM_SDID)
#define SIM_SCGC4                     (*((volatile uint32_t *)0x40048034))      // System Clock Gating Control Register 4 (SIM_SCGC4)
#define SIM_SCGC5                     (*((volatile uint32_t *)0x40048038))      // System Clock Gating Control Register 5 (SIM_SCGC5)
#define SIM_SCGC6                     (*((volatile uint32_t *)0x4004803C))      // System Clock Gating Control Register 6 (SIM_SCGC6)
#define SIM_SCGC7                     (*((volatile uint32_t *)0x40048040))      // System Clock Gating Control Register 7 (SIM_SCGC7)
#define SIM_CLKDIV1                   (*((volatile uint32_t *)0x40048044))      // System Clock Divider Register 1 (SIM_CLKDIV1)
#define SIM_CLKDIV2                   (*((volatile uint32_t *)0x40048048))      // System Clock Divider Register 2 (SIM_CLKDIV2)
#define SIM_FCFG1                     (*((volatile uint32_t *)0x4004804C))      // Flash Configuration Register 1 (SIM_FCFG1)
#define SIM_FCFG2                     (*((volatile uint32_t *)0x40048050))      // Flash Configuration Register 2 (SIM_FCFG2)
#define SIM_UIDH                      (*((volatile uint32_t *)0x40048054))      // Unique Identification Register High (SIM_UIDH)
#define SIM_UIDMH                     (*((volatile uint32_t *)0x40048058))      // Unique Identification Register Mid-High (SIM_UIDMH)
#define SIM_UIDML                     (*((volatile uint32_t *)0x4004805C))      // Unique Identification Register Mid Low (SIM_UIDML)
#define SIM_UIDL                      (*((volatile uint32_t *)0x40048060))      // Unique Identification Register Low (SIM_UIDL)
#define SIM_CLKDIV4                   (*((volatile uint32_t *)0x40048068))      // System Clock Divider Register 4 (SIM_CLKDIV4)
#define SIM_MISCTRL0                  (*((volatile uint32_t *)0x4004806C))      // Miscellaneous Control Register 0 (SIM_MISCTRL0)
#define SIM_MISCTRL1                  (*((volatile uint32_t *)0x40048070))      // Miscellaneous Control Register 1 (SIM_MISCTRL1)
#define SIM_WDOGC                     (*((volatile uint32_t *)0x40048100))      // WDOG Control Register (SIM_WDOGC)
#define SIM_PWRC                      (*((volatile uint32_t *)0x40048104))      // Power Control Register (SIM_PWRC)
#define SIM_ADCOPT                    (*((volatile uint32_t *)0x40048108))      // ADC Channel 6/7 Mux Control Register (SIM_ADCOPT)


//*****************************************************************************
//
// Reset Control Module (RCM) registers
//
//*****************************************************************************

#define RCM_SRS0                      (*((volatile uint32_t *)0x4007F000))      // System Reset Status Register 0
#define RCM_SRS1                      (*((volatile uint32_t *)0x4007F001))      // System Reset Status Register 1
#define RCM_RPFC                      (*((volatile uint32_t *)0x4007F004))      // Reset Pin Filter Control register
#define RCM_RPFW                      (*((volatile uint32_t *)0x4007F005))      // Reset Pin Filter Width register
#define RCM_SSRS0                     (*((volatile uint32_t *)0x4007F008))      // Sticky System Reset Status Register 0
#define RCM_SSRS1                     (*((volatile uint32_t *)0x4007F009))      // Sticky System Reset Status Register 1


//*****************************************************************************
//
// System Mode Controller (SMC) registers
//
//*****************************************************************************

#define SMC_PMPROT                    (*((volatile uint32_t *)0x4007E000))      // Power Mode Protection register (SMC_PMPROT)
#define SMC_PMCTRL                    (*((volatile uint32_t *)0x4007E001))      // Power Mode Control register (SMC_PMCTRL)
#define SMC_STOPCTRL                  (*((volatile uint32_t *)0x4007E002))      // Stop Control Register (SMC_STOPCTRL)
#define SMC_PMSTAT                    (*((volatile uint32_t *)0x4007E003))      // Power Mode Status register (SMC_PMSTAT)


//*****************************************************************************
//
// Low-Leakage Wakeup Unit (LLWU) registers
//
//*****************************************************************************

#define LLWU_PE1                      (*((volatile uint32_t *)0x4007C000))      // LLWU Pin Enable 1 register (LLWU_PE1)
#define LLWU_PE2                      (*((volatile uint32_t *)0x4007C001))      // LLWU Pin Enable 2 register (LLWU_PE2)
#define LLWU_PE3                      (*((volatile uint32_t *)0x4007C002))      // LLWU Pin Enable 3 register (LLWU_PE3)
#define LLWU_PE4                      (*((volatile uint32_t *)0x4007C003))      // LLWU Pin Enable 4 register (LLWU_PE4)
#define LLWU_PE5                      (*((volatile uint32_t *)0x4007C004))      // LLWU Pin Enable 5 register (LLWU_PE5)
#define LLWU_PE6                      (*((volatile uint32_t *)0x4007C005))      // LLWU Pin Enable 6 register (LLWU_PE6)
#define LLWU_PE7                      (*((volatile uint32_t *)0x4007C006))      // LLWU Pin Enable 7 register (LLWU_PE7)
#define LLWU_PE8                      (*((volatile uint32_t *)0x4007C007))      // LLWU Pin Enable 8 register (LLWU_PE8)
#define LLWU_ME                       (*((volatile uint32_t *)0x4007C008))      // LLWU Module Enable register (LLWU_ME)
#define LLWU_PF1                      (*((volatile uint32_t *)0x4007C009))      // LLWU Pin Flag 1 register (LLWU_PF1)
#define LLWU_PF2                      (*((volatile uint32_t *)0x4007C00A))      // LLWU Pin Flag 2 register (LLWU_PF2)
#define LLWU_PF3                      (*((volatile uint32_t *)0x4007C00B))      // LLWU Pin Flag 3 register (LLWU_PF3)
#define LLWU_PF4                      (*((volatile uint32_t *)0x4007C00C))      // LLWU Pin Flag 4 register (LLWU_PF4)
#define LLWU_MF5                      (*((volatile uint32_t *)0x4007C00D))      // LLWU Module Flag 5 register (LLWU_MF5)
#define LLWU_FILT1                    (*((volatile uint32_t *)0x4007C00E))      // LLWU Pin Filter 1 register (LLWU_FILT1)
#define LLWU_FILT2                    (*((volatile uint32_t *)0x4007C00F))      // LLWU Pin Filter 2 register (LLWU_FILT2)


//*****************************************************************************
//
// Peripheral Bridge (AIPS-Lite) registers
//
//*****************************************************************************

#define AIPS_MPRA                     (*((volatile uint32_t *)0x40000000))      // Master Privilege Register A (AIPS_MPRA)
#define AIPS_PACRA                    (*((volatile uint32_t *)0x40000020))      // Peripheral Access Control Register (AIPS_PACRA)
#define AIPS_PACRB                    (*((volatile uint32_t *)0x40000024))      // Peripheral Access Control Register (AIPS_PACRB)
#define AIPS_PACRC                    (*((volatile uint32_t *)0x40000028))      // Peripheral Access Control Register (AIPS_PACRC)
#define AIPS_PACRD                    (*((volatile uint32_t *)0x4000002C))      // Peripheral Access Control Register (AIPS_PACRD)
#define AIPS_PACRE                    (*((volatile uint32_t *)0x40000040))      // Peripheral Access Control Register (AIPS_PACRE)
#define AIPS_PACRF                    (*((volatile uint32_t *)0x40000044))      // Peripheral Access Control Register (AIPS_PACRF)
#define AIPS_PACRG                    (*((volatile uint32_t *)0x40000048))      // Peripheral Access Control Register (AIPS_PACRG)
#define AIPS_PACRH                    (*((volatile uint32_t *)0x4000004C))      // Peripheral Access Control Register (AIPS_PACRH)
#define AIPS_PACRI                    (*((volatile uint32_t *)0x40000050))      // Peripheral Access Control Register (AIPS_PACRI)
#define AIPS_PACRJ                    (*((volatile uint32_t *)0x40000054))      // Peripheral Access Control Register (AIPS_PACRJ)
#define AIPS_PACRK                    (*((volatile uint32_t *)0x40000058))      // Peripheral Access Control Register (AIPS_PACRK)
#define AIPS_PACRL                    (*((volatile uint32_t *)0x4000005C))      // Peripheral Access Control Register (AIPS_PACRL)
#define AIPS_PACRM                    (*((volatile uint32_t *)0x40000060))      // Peripheral Access Control Register (AIPS_PACRM)
#define AIPS_PACRN                    (*((volatile uint32_t *)0x40000064))      // Peripheral Access Control Register (AIPS_PACRN)
#define AIPS_PACRO                    (*((volatile uint32_t *)0x40000068))      // Peripheral Access Control Register (AIPS_PACRO)
#define AIPS_PACRP                    (*((volatile uint32_t *)0x4000006C))      // Peripheral Access Control Register (AIPS_PACRP)


//*****************************************************************************
//
// Direct memory access multiplexer (DMAMUX) registers
//
//*****************************************************************************

#define DMAMUX_CHCFG0                 (*((volatile uint32_t *)0x40021000))      // Channel Configuration register
#define DMAMUX_CHCFG1                 (*((volatile uint32_t *)0x40021001))      // Channel Configuration register
#define DMAMUX_CHCFG2                 (*((volatile uint32_t *)0x40021002))      // Channel Configuration register
#define DMAMUX_CHCFG3                 (*((volatile uint32_t *)0x40021003))      // Channel Configuration register
#define DMAMUX_CHCFG4                 (*((volatile uint32_t *)0x40021004))      // Channel Configuration register
#define DMAMUX_CHCFG5                 (*((volatile uint32_t *)0x40021005))      // Channel Configuration register
#define DMAMUX_CHCFG6                 (*((volatile uint32_t *)0x40021006))      // Channel Configuration register
#define DMAMUX_CHCFG7                 (*((volatile uint32_t *)0x40021007))      // Channel Configuration register
#define DMAMUX_CHCFG8                 (*((volatile uint32_t *)0x40021008))      // Channel Configuration register
#define DMAMUX_CHCFG9                 (*((volatile uint32_t *)0x40021009))      // Channel Configuration register
#define DMAMUX_CHCFG10                (*((volatile uint32_t *)0x4002100A))      // Channel Configuration register
#define DMAMUX_CHCFG11                (*((volatile uint32_t *)0x4002100B))      // Channel Configuration register
#define DMAMUX_CHCFG12                (*((volatile uint32_t *)0x4002100C))      // Channel Configuration register
#define DMAMUX_CHCFG13                (*((volatile uint32_t *)0x4002100D))      // Channel Configuration register
#define DMAMUX_CHCFG14                (*((volatile uint32_t *)0x4002100E))      // Channel Configuration register
#define DMAMUX_CHCFG15                (*((volatile uint32_t *)0x4002100F))      // Channel Configuration register


//*****************************************************************************
//
// Direct Memory Access Controller (eDMA) registers
//
//*****************************************************************************

#define DMA_CR                        (*((volatile uint32_t *)0x40008000))      // Control Register
#define DMA_ES                        (*((volatile uint32_t *)0x40008004))      // Error Status Register
#define DMA_ERQ                       (*((volatile uint32_t *)0x4000800C))      // Enable Request Register
#define DMA_EEI                       (*((volatile uint32_t *)0x40008014))      // Enable Error Interrupt Register
#define DMA_CEEI                      (*((volatile uint32_t *)0x40008018))      // Clear Enable Error Interrupt Register
#define DMA_SEEI                      (*((volatile uint32_t *)0x40008019))      // Set Enable Error Interrupt Register


//*****************************************************************************
//
// External Watchdog Monitor (EWM) registers
//
//*****************************************************************************

