MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV46F256VLL16Q/mcu.h
#define EWM_CTRL                      (*((volatile uint32_t *)0x40061000))      // Control Register (EWM_CTRL)
#define EWM_SERV                      (*((volatile uint32_t *)0x40061001))      // Service Register (EWM_SERV)
#define EWM_CMPL                      (*((volatile uint32_t *)0x40061002))      // Compare Low Register (EWM_CMPL)
#define EWM_CMPH                      (*((volatile uint32_t *)0x40061003))      // Compare High Register (EWM_CMPH)


//*****************************************************************************
//
// Watchdog Timer (WDOG) registers
//
//*****************************************************************************

#define WDOG_STCTRLH                  (*((volatile uint32_t *)0x40052000))      // Watchdog Status and Control Register High
#define WDOG_STCTRLL                  (*((volatile uint32_t *)0x40052002))      // Watchdog Status and Control Register Low
#define WDOG_TOVALH                   (*((volatile uint32_t *)0x40052004))      // Watchdog Time-out Value Register High
#define WDOG_TOVALL                   (*((volatile uint32_t *)0x40052006))      // Watchdog Time-out Value Register Low
#define WDOG_WINH                     (*((volatile uint32_t *)0x40052008))      // Watchdog Window Register High
#define WDOG_WINL                     (*((volatile uint32_t *)0x4005200A))      // Watchdog Window Register Low
#define WDOG_REFRESH                  (*((volatile uint32_t *)0x4005200C))      // Watchdog Refresh register
#define WDOG_UNLOCK                   (*((volatile uint32_t *)0x4005200E))      // Watchdog Unlock register
#define WDOG_TMROUTH                  (*((volatile uint32_t *)0x40052010))      // Watchdog Timer Output Register High
#define WDOG_TMROUTL                  (*((volatile uint32_t *)0x40052012))      // Watchdog Timer Output Register Low
#define WDOG_RSTCNT                   (*((volatile uint32_t *)0x40052014))      // Watchdog Reset Count register
#define WDOG_PRESC                    (*((volatile uint32_t *)0x40052016))      // Watchdog Prescaler register


//*****************************************************************************
//
// Inter-Peripheral Crossbar Switch A (XBARA) registers
//
//*****************************************************************************

#define XBARA_SEL0                    (*((volatile uint32_t *)0x40059000))      // Crossbar  A  Select  Register  0 (XBARA_SEL0)
#define XBARA_SEL1                    (*((volatile uint32_t *)0x40059002))      // Crossbar  A  Select  Register  1 (XBARA_SEL1)
#define XBARA_SEL2                    (*((volatile uint32_t *)0x40059004))      // Crossbar  A  Select  Register  2 (XBARA_SEL2)
#define XBARA_SEL3                    (*((volatile uint32_t *)0x40059006))      // Crossbar  A  Select  Register  3 (XBARA_SEL3)
#define XBARA_SEL4                    (*((volatile uint32_t *)0x40059008))      // Crossbar  A  Select  Register  4 (XBARA_SEL4)
#define XBARA_SEL5                    (*((volatile uint32_t *)0x4005900A))      // Crossbar  A  Select  Register  5 (XBARA_SEL5)
#define XBARA_SEL6                    (*((volatile uint32_t *)0x4005900C))      // Crossbar  A  Select  Register  6 (XBARA_SEL6)
#define XBARA_SEL7                    (*((volatile uint32_t *)0x4005900E))      // Crossbar  A  Select  Register  7 (XBARA_SEL7)
#define XBARA_SEL8                    (*((volatile uint32_t *)0x40059010))      // Crossbar  A  Select  Register  8 (XBARA_SEL8)
#define XBARA_SEL9                    (*((volatile uint32_t *)0x40059012))      // Crossbar  A  Select  Register  9 (XBARA_SEL9)
#define XBARA_SEL10                   (*((volatile uint32_t *)0x40059014))      // Crossbar  A  Select  Register  10 (XBARA_SEL10)
#define XBARA_SEL11                   (*((volatile uint32_t *)0x40059016))      // Crossbar  A  Select  Register  11 (XBARA_SEL11)
#define XBARA_SEL12                   (*((volatile uint32_t *)0x40059018))      // Crossbar  A  Select  Register  12 (XBARA_SEL12)
#define XBARA_SEL13                   (*((volatile uint32_t *)0x4005901A))      // Crossbar  A  Select  Register  13 (XBARA_SEL13)
#define XBARA_SEL14                   (*((volatile uint32_t *)0x4005901C))      // Crossbar  A  Select  Register  14 (XBARA_SEL14)
#define XBARA_SEL15                   (*((volatile uint32_t *)0x4005901E))      // Crossbar  A  Select  Register  15 (XBARA_SEL15)
#define XBARA_SEL16                   (*((volatile uint32_t *)0x40059020))      // Crossbar  A  Select  Register  16 (XBARA_SEL16)
#define XBARA_SEL17                   (*((volatile uint32_t *)0x40059022))      // Crossbar  A  Select  Register  17 (XBARA_SEL17)
#define XBARA_SEL18                   (*((volatile uint32_t *)0x40059024))      // Crossbar  A  Select  Register  18 (XBARA_SEL18)
#define XBARA_SEL19                   (*((volatile uint32_t *)0x40059026))      // Crossbar  A  Select  Register  19 (XBARA_SEL19)
#define XBARA_SEL20                   (*((volatile uint32_t *)0x40059028))      // Crossbar  A  Select  Register  20 (XBARA_SEL20)
#define XBARA_SEL21                   (*((volatile uint32_t *)0x4005902A))      // Crossbar  A  Select  Register  21 (XBARA_SEL21)
#define XBARA_SEL22                   (*((volatile uint32_t *)0x4005902C))      // Crossbar  A  Select  Register  22 (XBARA_SEL22)
#define XBARA_SEL23                   (*((volatile uint32_t *)0x4005902E))      // Crossbar  A  Select  Register  23 (XBARA_SEL23)
#define XBARA_SEL24                   (*((volatile uint32_t *)0x40059030))      // Crossbar  A  Select  Register  24 (XBARA_SEL24)
#define XBARA_SEL25                   (*((volatile uint32_t *)0x40059032))      // Crossbar  A  Select  Register  25 (XBARA_SEL25)
#define XBARA_SEL26                   (*((volatile uint32_t *)0x40059034))      // Crossbar  A  Select  Register  26 (XBARA_SEL26)
#define XBARA_SEL27                   (*((volatile uint32_t *)0x40059036))      // Crossbar  A  Select  Register  27 (XBARA_SEL27)
#define XBARA_SEL28                   (*((volatile uint32_t *)0x40059038))      // Crossbar  A  Select  Register  28 (XBARA_SEL28)


//*****************************************************************************
//
// Inter-Peripheral Crossbar Switch B (XBARB) registers
//
//*****************************************************************************

