MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV46F256VLL16Q/mcu.h
#define XBARB_SEL0                    (*((volatile uint32_t *)0x4005A000))      // Crossbar B Select Register 0
#define XBARB_SEL1                    (*((volatile uint32_t *)0x4005A002))      // Crossbar B Select Register 1
#define XBARB_SEL2                    (*((volatile uint32_t *)0x4005A004))      // Crossbar B Select Register 2
#define XBARB_SEL3                    (*((volatile uint32_t *)0x4005A006))      // Crossbar B Select Register 3
#define XBARB_SEL4                    (*((volatile uint32_t *)0x4005A008))      // Crossbar B Select Register 4
#define XBARB_SEL5                    (*((volatile uint32_t *)0x4005A00A))      // Crossbar B Select Register 5
#define XBARB_SEL6                    (*((volatile uint32_t *)0x4005A00C))      // Crossbar B Select Register 6
#define XBARB_SEL7                    (*((volatile uint32_t *)0x4005A00E))      // Crossbar B Select Register 7


//*****************************************************************************
//
// Crossbar AND/OR/INVERT (AOI) Module registers
//
//*****************************************************************************

#define AOI_BFCRT010                  (*((volatile uint32_t *)0x4005B000))      // Boolean Function Term 0 and 1 Configuration Register for EVENTn
#define AOI_BFCRT230                  (*((volatile uint32_t *)0x4005B002))      // Boolean Function Term 2 and 3 Configuration Register for EVENTn
#define AOI_BFCRT011                  (*((volatile uint32_t *)0x4005B004))      // Boolean Function Term 0 and 1 Configuration Register for EVENTn
#define AOI_BFCRT231                  (*((volatile uint32_t *)0x4005B006))      // Boolean Function Term 2 and 3 Configuration Register for EVENTn
#define AOI_BFCRT012                  (*((volatile uint32_t *)0x4005B008))      // Boolean Function Term 0 and 1 Configuration Register for EVENTn
#define AOI_BFCRT232                  (*((volatile uint32_t *)0x4005B00A))      // Boolean Function Term 2 and 3 Configuration Register for EVENTn
#define AOI_BFCRT013                  (*((volatile uint32_t *)0x4005B00C))      // Boolean Function Term 0 and 1 Configuration Register for EVENTn
#define AOI_BFCRT233                  (*((volatile uint32_t *)0x4005B00E))      // Boolean Function Term 2 and 3 Configuration Register for EVENTn


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC_CR                        (*((volatile uint32_t *)0x40065000))      // OSC Control Register
#define OSC_OSC_DIV                   (*((volatile uint32_t *)0x40065002))      // OSC Clock divider register


//*****************************************************************************
//
// Multipurpose Clock Generator (MCG) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control 1 Register
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control 2 Register
#define MCG_C3                        (*((volatile uint32_t *)0x40064002))      // MCG Control 3 Register
#define MCG_C4                        (*((volatile uint32_t *)0x40064003))      // MCG Control 4 Register
#define MCG_C5                        (*((volatile uint32_t *)0x40064004))      // MCG Control 5 Register
#define MCG_C6                        (*((volatile uint32_t *)0x40064005))      // MCG Control 6 Register
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register
#define MCG_ATCVH                     (*((volatile uint32_t *)0x4006400A))      // MCG Auto Trim Compare Value High Register
#define MCG_ATCVL                     (*((volatile uint32_t *)0x4006400B))      // MCG Auto Trim Compare Value Low Register
#define MCG_C8                        (*((volatile uint32_t *)0x4006400D))      // MCG Control 8 Register


//*****************************************************************************
//
// Flash Memory Controller (FMC) registers
//
//*****************************************************************************

#define FMC_PFAPR                     (*((volatile uint32_t *)0x4001F000))      // Flash Access Protection Register (FMC_PFAPR)
#define FMC_PFB0CR                    (*((volatile uint32_t *)0x4001F004))      // Flash Bank 0 Control Register (FMC_PFB0CR)
#define FMC_TAGVDW0S0                 (*((volatile uint32_t *)0x4001F100))      // Cache Tag Storage (FMC_TAGVDW0S0)
#define FMC_TAGVDW0S1                 (*((volatile uint32_t *)0x4001F104))      // Cache Tag Storage (FMC_TAGVDW0S1)
#define FMC_TAGVDW1S0                 (*((volatile uint32_t *)0x4001F108))      // Cache Tag Storage (FMC_TAGVDW1S0)
#define FMC_TAGVDW1S1                 (*((volatile uint32_t *)0x4001F10C))      // Cache Tag Storage (FMC_TAGVDW1S1)
#define FMC_TAGVDW2S0                 (*((volatile uint32_t *)0x4001F110))      // Cache Tag Storage (FMC_TAGVDW2S0)
#define FMC_TAGVDW2S1                 (*((volatile uint32_t *)0x4001F114))      // Cache Tag Storage (FMC_TAGVDW2S1)
#define FMC_TAGVDW3S0                 (*((volatile uint32_t *)0x4001F118))      // Cache Tag Storage (FMC_TAGVDW3S0)
#define FMC_TAGVDW3S1                 (*((volatile uint32_t *)0x4001F11C))      // Cache Tag Storage (FMC_TAGVDW3S1)
#define FMC_DATAW0S0UM                (*((volatile uint32_t *)0x4001F200))      // Cache Data Storage (uppermost word)
#define FMC_DATAW0S0MU                (*((volatile uint32_t *)0x4001F204))      // Cache Data Storage (mid-upper word)
#define FMC_DATAW0S0ML                (*((volatile uint32_t *)0x4001F208))      // Cache Data Storage (mid-lower word)
#define FMC_DATAW0S0LM                (*((volatile uint32_t *)0x4001F20C))      // Cache Data Storage (lowermost word)
#define FMC_DATAW0S1UM                (*((volatile uint32_t *)0x4001F210))      // Cache Data Storage (uppermost word)
#define FMC_DATAW0S1MU                (*((volatile uint32_t *)0x4001F214))      // Cache Data Storage (mid-upper word)
#define FMC_DATAW0S1ML                (*((volatile uint32_t *)0x4001F218))      // Cache Data Storage (mid-lower word)
#define FMC_DATAW0S1LM                (*((volatile uint32_t *)0x4001F21C))      // Cache Data Storage (lowermost word)
#define FMC_DATAW1S0UM                (*((volatile uint32_t *)0x4001F240))      // Cache Data Storage (uppermost word)
#define FMC_DATAW1S0MU                (*((volatile uint32_t *)0x4001F244))      // Cache Data Storage (mid-upper word)
#define FMC_DATAW1S0ML                (*((volatile uint32_t *)0x4001F248))      // Cache Data Storage (mid-lower word)
#define FMC_DATAW1S0LM                (*((volatile uint32_t *)0x4001F24C))      // Cache Data Storage (lowermost word)
#define FMC_DATAW1S1UM                (*((volatile uint32_t *)0x4001F250))      // Cache Data Storage (uppermost word)
#define FMC_DATAW1S1MU                (*((volatile uint32_t *)0x4001F254))      // Cache Data Storage (mid-upper word)
#define FMC_DATAW1S1ML                (*((volatile uint32_t *)0x4001F258))      // Cache Data Storage (mid-lower word)
#define FMC_DATAW1S1LM                (*((volatile uint32_t *)0x4001F25C))      // Cache Data Storage (lowermost word)


//*****************************************************************************
//
// Cyclic redundancy check (CRC) registers
//
//*****************************************************************************

#define CRC_DATA                      (*((volatile uint32_t *)0x40032000))      // CRC Data register
#define CRC_GPOLY                     (*((volatile uint32_t *)0x40032004))      // CRC Polynomial register
#define CRC_CTRL                      (*((volatile uint32_t *)0x40032008))      // CRC Control register


//*****************************************************************************
//
// 12-bit Cyclic Analog-to-Digital Converter (ADC) registers
//
//*****************************************************************************

#define ADC_CTRL1                     (*((volatile uint32_t *)0x4005C000))      // ADC Control Register 1 (ADC_CTRL1)
#define ADC_CTRL2                     (*((volatile uint32_t *)0x4005C002))      // ADC Control Register 2 (ADC_CTRL2)
#define ADC_ZXCTRL1                   (*((volatile uint32_t *)0x4005C004))      // ADC Zero Crossing Control 1 Register (ADC_ZXCTRL1)
#define ADC_ZXCTRL2                   (*((volatile uint32_t *)0x4005C006))      // ADC Zero Crossing Control 2 Register (ADC_ZXCTRL2)
#define ADC_CLIST1                    (*((volatile uint32_t *)0x4005C008))      // ADC Channel List Register 1 (ADC_CLIST1)
#define ADC_CLIST2                    (*((volatile uint32_t *)0x4005C00A))      // ADC Channel List Register 2 (ADC_CLIST2)
#define ADC_CLIST3                    (*((volatile uint32_t *)0x4005C00C))      // ADC Channel List Register 3 (ADC_CLIST3)
#define ADC_CLIST4                    (*((volatile uint32_t *)0x4005C00E))      // ADC Channel List Register 4 (ADC_CLIST4)
#define ADC_SDIS                      (*((volatile uint32_t *)0x4005C010))      // ADC Sample Disable Register (ADC_SDIS)
#define ADC_STAT                      (*((volatile uint32_t *)0x4005C012))      // ADC Status Register (ADC_STAT)
#define ADC_RDY                       (*((volatile uint32_t *)0x4005C014))      // ADC Ready Register (ADC_RDY)
#define ADC_LOLIMSTAT                 (*((volatile uint32_t *)0x4005C016))      // ADC Low Limit Status Register (ADC_LOLIMSTAT)
#define ADC_HILIMSTAT                 (*((volatile uint32_t *)0x4005C018))      // ADC High Limit Status Register (ADC_HILIMSTAT)
#define ADC_ZXSTAT                    (*((volatile uint32_t *)0x4005C01A))      // ADC Zero Crossing Status Register (ADC_ZXSTAT)
#define ADC_RSLT0                     (*((volatile uint32_t *)0x4005C01C))      // ADC Result Registers with sign extension (ADC_RSLT0)
#define ADC_RSLT1                     (*((volatile uint32_t *)0x4005C01E))      // ADC Result Registers with sign extension (ADC_RSLT1)
#define ADC_RSLT2                     (*((volatile uint32_t *)0x4005C020))      // ADC Result Registers with sign extension (ADC_RSLT2)
#define ADC_RSLT3                     (*((volatile uint32_t *)0x4005C022))      // ADC Result Registers with sign extension (ADC_RSLT3)
#define ADC_RSLT4                     (*((volatile uint32_t *)0x4005C024))      // ADC Result Registers with sign extension (ADC_RSLT4)
#define ADC_RSLT5                     (*((volatile uint32_t *)0x4005C026))      // ADC Result Registers with sign extension (ADC_RSLT5)
#define ADC_RSLT6                     (*((volatile uint32_t *)0x4005C028))      // ADC Result Registers with sign extension (ADC_RSLT6)
#define ADC_RSLT7                     (*((volatile uint32_t *)0x4005C02A))      // ADC Result Registers with sign extension (ADC_RSLT7)
#define ADC_RSLT8                     (*((volatile uint32_t *)0x4005C02C))      // ADC Result Registers with sign extension (ADC_RSLT8)
#define ADC_RSLT9                     (*((volatile uint32_t *)0x4005C02E))      // ADC Result Registers with sign extension (ADC_RSLT9)
#define ADC_RSLT10                    (*((volatile uint32_t *)0x4005C030))      // ADC Result Registers with sign extension (ADC_RSLT10)
#define ADC_RSLT11                    (*((volatile uint32_t *)0x4005C032))      // ADC Result Registers with sign extension (ADC_RSLT11)
#define ADC_RSLT12                    (*((volatile uint32_t *)0x4005C034))      // ADC Result Registers with sign extension (ADC_RSLT12)
#define ADC_RSLT13                    (*((volatile uint32_t *)0x4005C036))      // ADC Result Registers with sign extension (ADC_RSLT13)
#define ADC_RSLT14                    (*((volatile uint32_t *)0x4005C038))      // ADC Result Registers with sign extension (ADC_RSLT14)
#define ADC_RSLT15                    (*((volatile uint32_t *)0x4005C03A))      // ADC Result Registers with sign extension (ADC_RSLT15)
#define ADC_LOLIM0                    (*((volatile uint32_t *)0x4005C03C))      // ADC Low Limit Registers (ADC_LOLIM0)
#define ADC_LOLIM1                    (*((volatile uint32_t *)0x4005C03E))      // ADC Low Limit Registers (ADC_LOLIM1)
#define ADC_LOLIM2                    (*((volatile uint32_t *)0x4005C040))      // ADC Low Limit Registers (ADC_LOLIM2)
#define ADC_LOLIM3                    (*((volatile uint32_t *)0x4005C042))      // ADC Low Limit Registers (ADC_LOLIM3)
#define ADC_LOLIM4                    (*((volatile uint32_t *)0x4005C044))      // ADC Low Limit Registers (ADC_LOLIM4)
#define ADC_LOLIM5                    (*((volatile uint32_t *)0x4005C046))      // ADC Low Limit Registers (ADC_LOLIM5)
#define ADC_LOLIM6                    (*((volatile uint32_t *)0x4005C048))      // ADC Low Limit Registers (ADC_LOLIM6)
#define ADC_LOLIM7                    (*((volatile uint32_t *)0x4005C04A))      // ADC Low Limit Registers (ADC_LOLIM7)
#define ADC_LOLIM8                    (*((volatile uint32_t *)0x4005C04C))      // ADC Low Limit Registers (ADC_LOLIM8)
#define ADC_LOLIM9                    (*((volatile uint32_t *)0x4005C04E))      // ADC Low Limit Registers (ADC_LOLIM9)
#define ADC_LOLIM10                   (*((volatile uint32_t *)0x4005C050))      // ADC Low Limit Registers (ADC_LOLIM10)
#define ADC_LOLIM11                   (*((volatile uint32_t *)0x4005C052))      // ADC Low Limit Registers (ADC_LOLIM11)
#define ADC_LOLIM12                   (*((volatile uint32_t *)0x4005C054))      // ADC Low Limit Registers (ADC_LOLIM12)
#define ADC_LOLIM13                   (*((volatile uint32_t *)0x4005C056))      // ADC Low Limit Registers (ADC_LOLIM13)
#define ADC_LOLIM14                   (*((volatile uint32_t *)0x4005C058))      // ADC Low Limit Registers (ADC_LOLIM14)
#define ADC_LOLIM15                   (*((volatile uint32_t *)0x4005C05A))      // ADC Low Limit Registers (ADC_LOLIM15)
#define ADC_HILIM0                    (*((volatile uint32_t *)0x4005C05C))      // ADC High Limit Registers (ADC_HILIM0)
#define ADC_HILIM1                    (*((volatile uint32_t *)0x4005C05E))      // ADC High Limit Registers (ADC_HILIM1)
#define ADC_HILIM2                    (*((volatile uint32_t *)0x4005C060))      // ADC High Limit Registers (ADC_HILIM2)
#define ADC_HILIM3                    (*((volatile uint32_t *)0x4005C062))      // ADC High Limit Registers (ADC_HILIM3)
#define ADC_HILIM4                    (*((volatile uint32_t *)0x4005C064))      // ADC High Limit Registers (ADC_HILIM4)
#define ADC_HILIM5                    (*((volatile uint32_t *)0x4005C066))      // ADC High Limit Registers (ADC_HILIM5)
#define ADC_HILIM6                    (*((volatile uint32_t *)0x4005C068))      // ADC High Limit Registers (ADC_HILIM6)
#define ADC_HILIM7                    (*((volatile uint32_t *)0x4005C06A))      // ADC High Limit Registers (ADC_HILIM7)
#define ADC_HILIM8                    (*((volatile uint32_t *)0x4005C06C))      // ADC High Limit Registers (ADC_HILIM8)
#define ADC_HILIM9                    (*((volatile uint32_t *)0x4005C06E))      // ADC High Limit Registers (ADC_HILIM9)
#define ADC_HILIM10                   (*((volatile uint32_t *)0x4005C070))      // ADC High Limit Registers (ADC_HILIM10)
#define ADC_HILIM11                   (*((volatile uint32_t *)0x4005C072))      // ADC High Limit Registers (ADC_HILIM11)
#define ADC_HILIM12                   (*((volatile uint32_t *)0x4005C074))      // ADC High Limit Registers (ADC_HILIM12)
#define ADC_HILIM13                   (*((volatile uint32_t *)0x4005C076))      // ADC High Limit Registers (ADC_HILIM13)
#define ADC_HILIM14                   (*((volatile uint32_t *)0x4005C078))      // ADC High Limit Registers (ADC_HILIM14)
#define ADC_HILIM15                   (*((volatile uint32_t *)0x4005C07A))      // ADC High Limit Registers (ADC_HILIM15)
#define ADC_OFFST0                    (*((volatile uint32_t *)0x4005C07C))      // ADC Offset Registers (ADC_OFFST0)
#define ADC_OFFST1                    (*((volatile uint32_t *)0x4005C07E))      // ADC Offset Registers (ADC_OFFST1)
#define ADC_OFFST2                    (*((volatile uint32_t *)0x4005C080))      // ADC Offset Registers (ADC_OFFST2)
#define ADC_OFFST3                    (*((volatile uint32_t *)0x4005C082))      // ADC Offset Registers (ADC_OFFST3)
#define ADC_OFFST4                    (*((volatile uint32_t *)0x4005C084))      // ADC Offset Registers (ADC_OFFST4)
#define ADC_OFFST5                    (*((volatile uint32_t *)0x4005C086))      // ADC Offset Registers (ADC_OFFST5)
#define ADC_OFFST6                    (*((volatile uint32_t *)0x4005C088))      // ADC Offset Registers (ADC_OFFST6)
#define ADC_OFFST7                    (*((volatile uint32_t *)0x4005C08A))      // ADC Offset Registers (ADC_OFFST7)
#define ADC_OFFST8                    (*((volatile uint32_t *)0x4005C08C))      // ADC Offset Registers (ADC_OFFST8)
#define ADC_OFFST9                    (*((volatile uint32_t *)0x4005C08E))      // ADC Offset Registers (ADC_OFFST9)
#define ADC_OFFST10                   (*((volatile uint32_t *)0x4005C090))      // ADC Offset Registers (ADC_OFFST10)
#define ADC_OFFST11                   (*((volatile uint32_t *)0x4005C092))      // ADC Offset Registers (ADC_OFFST11)
#define ADC_OFFST12                   (*((volatile uint32_t *)0x4005C094))      // ADC Offset Registers (ADC_OFFST12)
#define ADC_OFFST13                   (*((volatile uint32_t *)0x4005C096))      // ADC Offset Registers (ADC_OFFST13)
#define ADC_OFFST14                   (*((volatile uint32_t *)0x4005C098))      // ADC Offset Registers (ADC_OFFST14)
#define ADC_OFFST15                   (*((volatile uint32_t *)0x4005C09A))      // ADC Offset Registers (ADC_OFFST15)
#define ADC_PWR                       (*((volatile uint32_t *)0x4005C09C))      // ADC Power Control Register (ADC_PWR)
#define ADC_CAL                       (*((volatile uint32_t *)0x4005C09E))      // ADC Calibration Register (ADC_CAL)
#define ADC_GC1                       (*((volatile uint32_t *)0x4005C0A0))      // Gain Control 1 Register (ADC_GC1)
#define ADC_GC2                       (*((volatile uint32_t *)0x4005C0A2))      // Gain Control 2 Register (ADC_GC2)
#define ADC_SCTRL                     (*((volatile uint32_t *)0x4005C0A4))      // ADC Scan Control Register (ADC_SCTRL)
#define ADC_PWR2                      (*((volatile uint32_t *)0x4005C0A6))      // ADC Power Control Register (ADC_PWR2)
#define ADC_CTRL3                     (*((volatile uint32_t *)0x4005C0A8))      // ADC Control Register 3 (ADC_CTRL3)
#define ADC_SCHLTEN                   (*((volatile uint32_t *)0x4005C0AA))      // ADC Scan Interrupt Enable Register (ADC_SCHLTEN)


//*****************************************************************************
//
// Comparator (CMP) registers
//
//*****************************************************************************

#define CMP0_CR0                      (*((volatile uint32_t *)0x40073000))      // CMP Control Register 0 (CMP0_CR0)
#define CMP0_CR1                      (*((volatile uint32_t *)0x40073001))      // CMP Control Register 1 (CMP0_CR1)
#define CMP0_FPR                      (*((volatile uint32_t *)0x40073002))      // CMP Filter Period Register (CMP0_FPR)
#define CMP0_SCR                      (*((volatile uint32_t *)0x40073003))      // CMP Status and Control Register (CMP0_SCR)
#define CMP0_DACCR                    (*((volatile uint32_t *)0x40073004))      // DAC Control Register (CMP0_DACCR)
#define CMP0_MUXCR                    (*((volatile uint32_t *)0x40073005))      // MUX Control Register (CMP0_MUXCR)
#define CMP1_CR0                      (*((volatile uint32_t *)0x40073008))      // CMP Control Register 0 (CMP1_CR0)
#define CMP1_CR1                      (*((volatile uint32_t *)0x40073009))      // CMP Control Register 1 (CMP1_CR1)
#define CMP1_FPR                      (*((volatile uint32_t *)0x4007300A))      // CMP Filter Period Register (CMP1_FPR)
#define CMP1_SCR                      (*((volatile uint32_t *)0x4007300B))      // CMP Status and Control Register (CMP1_SCR)
#define CMP1_DACCR                    (*((volatile uint32_t *)0x4007300C))      // DAC Control Register (CMP1_DACCR)
#define CMP1_MUXCR                    (*((volatile uint32_t *)0x4007300D))      // MUX Control Register (CMP1_MUXCR)
#define CMP2_CR0                      (*((volatile uint32_t *)0x40073010))      // CMP Control Register 0 (CMP2_CR0)
#define CMP2_CR1                      (*((volatile uint32_t *)0x40073011))      // CMP Control Register 1 (CMP2_CR1)
#define CMP2_FPR                      (*((volatile uint32_t *)0x40073012))      // CMP Filter Period Register (CMP2_FPR)
#define CMP2_SCR                      (*((volatile uint32_t *)0x40073013))      // CMP Status and Control Register (CMP2_SCR)
#define CMP2_DACCR                    (*((volatile uint32_t *)0x40073014))      // DAC Control Register (CMP2_DACCR)
#define CMP2_MUXCR                    (*((volatile uint32_t *)0x40073015))      // MUX Control Register (CMP2_MUXCR)
#define CMP3_CR0                      (*((volatile uint32_t *)0x40073018))      // CMP Control Register 0 (CMP3_CR0)
#define CMP3_CR1                      (*((volatile uint32_t *)0x40073019))      // CMP Control Register 1 (CMP3_CR1)
#define CMP3_FPR                      (*((volatile uint32_t *)0x4007301A))      // CMP Filter Period Register (CMP3_FPR)
#define CMP3_SCR                      (*((volatile uint32_t *)0x4007301B))      // CMP Status and Control Register (CMP3_SCR)
#define CMP3_DACCR                    (*((volatile uint32_t *)0x4007301C))      // DAC Control Register (CMP3_DACCR)
#define CMP3_MUXCR                    (*((volatile uint32_t *)0x4007301D))      // MUX Control Register (CMP3_MUXCR)


//*****************************************************************************
//
// 12-bit Digital-to-Analog Converter (DAC) registers
//
//*****************************************************************************

