MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV46F256VLL16Q/mcu.h
#define DAC0_DAT0L                    (*((volatile uint32_t *)0x4003F000))      // DAC Data Low Register
#define DAC0_DAT0H                    (*((volatile uint32_t *)0x4003F001))      // DAC Data High Register
#define DAC0_DAT1L                    (*((volatile uint32_t *)0x4003F002))      // DAC Data Low Register
#define DAC0_DAT1H                    (*((volatile uint32_t *)0x4003F003))      // DAC Data High Register
#define DAC0_DAT2L                    (*((volatile uint32_t *)0x4003F004))      // DAC Data Low Register
#define DAC0_DAT2H                    (*((volatile uint32_t *)0x4003F005))      // DAC Data High Register
#define DAC0_DAT3L                    (*((volatile uint32_t *)0x4003F006))      // DAC Data Low Register
#define DAC0_DAT3H                    (*((volatile uint32_t *)0x4003F007))      // DAC Data High Register
#define DAC0_DAT4L                    (*((volatile uint32_t *)0x4003F008))      // DAC Data Low Register
#define DAC0_DAT4H                    (*((volatile uint32_t *)0x4003F009))      // DAC Data High Register
#define DAC0_DAT5L                    (*((volatile uint32_t *)0x4003F00A))      // DAC Data Low Register
#define DAC0_DAT5H                    (*((volatile uint32_t *)0x4003F00B))      // DAC Data High Register
#define DAC0_DAT6L                    (*((volatile uint32_t *)0x4003F00C))      // DAC Data Low Register
#define DAC0_DAT6H                    (*((volatile uint32_t *)0x4003F00D))      // DAC Data High Register
#define DAC0_DAT7L                    (*((volatile uint32_t *)0x4003F00E))      // DAC Data Low Register
#define DAC0_DAT7H                    (*((volatile uint32_t *)0x4003F00F))      // DAC Data High Register
#define DAC0_DAT8L                    (*((volatile uint32_t *)0x4003F010))      // DAC Data Low Register
#define DAC0_DAT8H                    (*((volatile uint32_t *)0x4003F011))      // DAC Data High Register
#define DAC0_DAT9L                    (*((volatile uint32_t *)0x4003F012))      // DAC Data Low Register
#define DAC0_DAT9H                    (*((volatile uint32_t *)0x4003F013))      // DAC Data High Register
#define DAC0_DAT10L                   (*((volatile uint32_t *)0x4003F014))      // DAC Data Low Register
#define DAC0_DAT10H                   (*((volatile uint32_t *)0x4003F015))      // DAC Data High Register
#define DAC0_DAT11L                   (*((volatile uint32_t *)0x4003F016))      // DAC Data Low Register
#define DAC0_DAT11H                   (*((volatile uint32_t *)0x4003F017))      // DAC Data High Register
#define DAC0_DAT12L                   (*((volatile uint32_t *)0x4003F018))      // DAC Data Low Register
#define DAC0_DAT12H                   (*((volatile uint32_t *)0x4003F019))      // DAC Data High Register
#define DAC0_DAT13L                   (*((volatile uint32_t *)0x4003F01A))      // DAC Data Low Register
#define DAC0_DAT13H                   (*((volatile uint32_t *)0x4003F01B))      // DAC Data High Register
#define DAC0_DAT14L                   (*((volatile uint32_t *)0x4003F01C))      // DAC Data Low Register
#define DAC0_DAT14H                   (*((volatile uint32_t *)0x4003F01D))      // DAC Data High Register
#define DAC0_DAT15L                   (*((volatile uint32_t *)0x4003F01E))      // DAC Data Low Register
#define DAC0_DAT15H                   (*((volatile uint32_t *)0x4003F01F))      // DAC Data High Register
#define DAC0_SR                       (*((volatile uint32_t *)0x4003F020))      // DAC Status Register
#define DAC0_C0                       (*((volatile uint32_t *)0x4003F021))      // DAC Control Register
#define DAC0_C1                       (*((volatile uint32_t *)0x4003F022))      // DAC Control Register 1
#define DAC0_C2                       (*((volatile uint32_t *)0x4003F023))      // DAC Control Register 2


//*****************************************************************************
//
// Programmable Delay Block (PDB) registers
//
//*****************************************************************************

#define PDB1_SC                       (*((volatile uint32_t *)0x40031000))      // Status and Control register
#define PDB1_MOD                      (*((volatile uint32_t *)0x40031004))      // Modulus register
#define PDB1_CNT                      (*((volatile uint32_t *)0x40031008))      // Counter register
#define PDB1_IDLY                     (*((volatile uint32_t *)0x4003100C))      // Interrupt Delay register
#define PDB1_CH0C1                    (*((volatile uint32_t *)0x40031010))      // Channel n Control register 1
#define PDB1_CH0S                     (*((volatile uint32_t *)0x40031014))      // Channel n Status register
#define PDB1_CH0DLY0                  (*((volatile uint32_t *)0x40031018))      // Channel n Delay 0 register
#define PDB1_CH0DLY1                  (*((volatile uint32_t *)0x4003101C))      // Channel n Delay 1 register
#define PDB1_CH0DLY2                  (*((volatile uint32_t *)0x40031020))      // Channel n Delay 2 register
#define PDB1_CH0DLY3                  (*((volatile uint32_t *)0x40031024))      // Channel n Delay 3 register
#define PDB1_DACINTC0                 (*((volatile uint32_t *)0x40031150))      // DAC Interval Trigger n Control register
#define PDB1_DACINT0                  (*((volatile uint32_t *)0x40031154))      // DAC Interval n register
#define PDB1_POEN                     (*((volatile uint32_t *)0x40031190))      // Pulse-Out n Enable register
#define PDB1_PO0DLY                   (*((volatile uint32_t *)0x40031194))      // Pulse-Out n Delay register
#define PDB1_PO1DLY                   (*((volatile uint32_t *)0x40031198))      // Pulse-Out n Delay register
#define PDB1_PO2DLY                   (*((volatile uint32_t *)0x4003119C))      // Pulse-Out n Delay register
#define PDB1_PO3DLY                   (*((volatile uint32_t *)0x400311A0))      // Pulse-Out n Delay register
#define PDB0_SC                       (*((volatile uint32_t *)0x40036000))      // Status and Control register
#define PDB0_MOD                      (*((volatile uint32_t *)0x40036004))      // Modulus register
#define PDB0_CNT                      (*((volatile uint32_t *)0x40036008))      // Counter register
#define PDB0_IDLY                     (*((volatile uint32_t *)0x4003600C))      // Interrupt Delay register
#define PDB0_CH0C1                    (*((volatile uint32_t *)0x40036010))      // Channel n Control register 1
#define PDB0_CH0S                     (*((volatile uint32_t *)0x40036014))      // Channel n Status register
#define PDB0_CH0DLY0                  (*((volatile uint32_t *)0x40036018))      // Channel n Delay 0 register
#define PDB0_CH0DLY1                  (*((volatile uint32_t *)0x4003601C))      // Channel n Delay 1 register
#define PDB0_CH0DLY2                  (*((volatile uint32_t *)0x40036020))      // Channel n Delay 2 register
#define PDB0_CH0DLY3                  (*((volatile uint32_t *)0x40036024))      // Channel n Delay 3 register
#define PDB0_DACINTC0                 (*((volatile uint32_t *)0x40036150))      // DAC Interval Trigger n Control register
#define PDB0_DACINT0                  (*((volatile uint32_t *)0x40036154))      // DAC Interval n register
#define PDB0_POEN                     (*((volatile uint32_t *)0x40036190))      // Pulse-Out n Enable register
#define PDB0_PO0DLY                   (*((volatile uint32_t *)0x40036194))      // Pulse-Out n Delay register
#define PDB0_PO1DLY                   (*((volatile uint32_t *)0x40036198))      // Pulse-Out n Delay register
#define PDB0_PO2DLY                   (*((volatile uint32_t *)0x4003619C))      // Pulse-Out n Delay register
#define PDB0_PO3DLY                   (*((volatile uint32_t *)0x400361A0))      // Pulse-Out n Delay register


//*****************************************************************************
//
// FlexTimer Module (FTM) registers
//
//*****************************************************************************

#define FTM3_SC                       (*((volatile uint32_t *)0x40026000))      // Status And Control
#define FTM3_CNT                      (*((volatile uint32_t *)0x40026004))      // Counter
#define FTM3_MOD                      (*((volatile uint32_t *)0x40026008))      // Modulo
#define FTM3_C0SC                     (*((volatile uint32_t *)0x4002600C))      // Channel (n) Status And Control
#define FTM3_C0V                      (*((volatile uint32_t *)0x40026010))      // Channel (n) Value
#define FTM3_C1SC                     (*((volatile uint32_t *)0x40026014))      // Channel (n) Status And Control
#define FTM3_C1V                      (*((volatile uint32_t *)0x40026018))      // Channel (n) Value
#define FTM3_C2SC                     (*((volatile uint32_t *)0x4002601C))      // Channel (n) Status And Control
#define FTM3_C2V                      (*((volatile uint32_t *)0x40026020))      // Channel (n) Value
#define FTM3_C3SC                     (*((volatile uint32_t *)0x40026024))      // Channel (n) Status And Control
#define FTM3_C3V                      (*((volatile uint32_t *)0x40026028))      // Channel (n) Value
#define FTM3_C4SC                     (*((volatile uint32_t *)0x4002602C))      // Channel (n) Status And Control
#define FTM3_C4V                      (*((volatile uint32_t *)0x40026030))      // Channel (n) Value
#define FTM3_C5SC                     (*((volatile uint32_t *)0x40026034))      // Channel (n) Status And Control
#define FTM3_C5V                      (*((volatile uint32_t *)0x40026038))      // Channel (n) Value
#define FTM3_C6SC                     (*((volatile uint32_t *)0x4002603C))      // Channel (n) Status And Control
#define FTM3_C6V                      (*((volatile uint32_t *)0x40026040))      // Channel (n) Value
#define FTM3_C7SC                     (*((volatile uint32_t *)0x40026044))      // Channel (n) Status And Control
#define FTM3_C7V                      (*((volatile uint32_t *)0x40026048))      // Channel (n) Value
#define FTM3_CNTIN                    (*((volatile uint32_t *)0x4002604C))      // Counter Initial Value


//*****************************************************************************
//
// Periodic Interrupt Timer (PIT) registers
//
//*****************************************************************************

#define PIT_MCR                       (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register
#define PIT_LDVAL0                    (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register
#define PIT_CVAL0                     (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register
#define PIT_TCTRL0                    (*((volatile uint32_t *)0x40037108))      // Timer Control Register
#define PIT_TFLG0                     (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register
#define PIT_LDVAL1                    (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register
#define PIT_CVAL1                     (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register
#define PIT_TCTRL1                    (*((volatile uint32_t *)0x40037118))      // Timer Control Register
#define PIT_TFLG1                     (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register
#define PIT_LDVAL2                    (*((volatile uint32_t *)0x40037120))      // Timer Load Value Register
#define PIT_CVAL2                     (*((volatile uint32_t *)0x40037124))      // Current Timer Value Register
#define PIT_TCTRL2                    (*((volatile uint32_t *)0x40037128))      // Timer Control Register
#define PIT_TFLG2                     (*((volatile uint32_t *)0x4003712C))      // Timer Flag Register
#define PIT_LDVAL3                    (*((volatile uint32_t *)0x40037130))      // Timer Load Value Register
#define PIT_CVAL3                     (*((volatile uint32_t *)0x40037134))      // Current Timer Value Register
#define PIT_TCTRL3                    (*((volatile uint32_t *)0x40037138))      // Timer Control Register
#define PIT_TFLG3                     (*((volatile uint32_t *)0x4003713C))      // Timer Flag Register


//*****************************************************************************
//
// Quadrature Encoder/Decoder (ENC) registers
//
//*****************************************************************************

#define ENC0_CTRL                     (*((volatile uint32_t *)0x40055000))      // Control Register (ENC0_CTRL)
#define ENC0_FILT                     (*((volatile uint32_t *)0x40055002))      // Input Filter Register (ENC0_FILT)
#define ENC0_WTR                      (*((volatile uint32_t *)0x40055004))      // Watchdog Timeout Register (ENC0_WTR)
#define ENC0_POSD                     (*((volatile uint32_t *)0x40055006))      // Position Difference Counter Register (ENC0_POSD)
#define ENC0_POSDH                    (*((volatile uint32_t *)0x40055008))      // Position Difference Hold Register (ENC0_POSDH)
#define ENC0_REV                      (*((volatile uint32_t *)0x4005500A))      // Revolution Counter Register (ENC0_REV)
#define ENC0_REVH                     (*((volatile uint32_t *)0x4005500C))      // Revolution Hold Register (ENC0_REVH)
#define ENC0_UPOS                     (*((volatile uint32_t *)0x4005500E))      // Upper Position Counter Register (ENC0_UPOS)
#define ENC0_LPOS                     (*((volatile uint32_t *)0x40055010))      // Lower Position Counter Register (ENC0_LPOS)
#define ENC0_UPOSH                    (*((volatile uint32_t *)0x40055012))      // Upper Position Hold Register (ENC0_UPOSH)
#define ENC0_LPOSH                    (*((volatile uint32_t *)0x40055014))      // Lower Position Hold Register (ENC0_LPOSH)
#define ENC0_UINIT                    (*((volatile uint32_t *)0x40055016))      // Upper Initialization Register (ENC0_UINIT)
#define ENC0_LINIT                    (*((volatile uint32_t *)0x40055018))      // Lower Initialization Register (ENC0_LINIT)
#define ENC0_IMR                      (*((volatile uint32_t *)0x4005501A))      // Input Monitor Register (ENC0_IMR)
#define ENC0_TST                      (*((volatile uint32_t *)0x4005501C))      // Test Register (ENC0_TST)
#define ENC0_CTRL2                    (*((volatile uint32_t *)0x4005501E))      // Control 2 Register (ENC0_CTRL2)
#define ENC0_UMOD                     (*((volatile uint32_t *)0x40055020))      // Upper Modulus Register (ENC0_UMOD)
#define ENC0_LMOD                     (*((volatile uint32_t *)0x40055022))      // Lower Modulus Register (ENC0_LMOD)
#define ENC0_UCOMP                    (*((volatile uint32_t *)0x40055024))      // Upper Position Compare Register (ENC0_UCOMP)
#define ENC0_LCOMP                    (*((volatile uint32_t *)0x40055026))      // Lower Position Compare Register (ENC0_LCOMP)


//*****************************************************************************
//
// Low-Power Timer (LPTMR) registers
//
//*****************************************************************************

#define LPTMR0_CSR                    (*((volatile uint32_t *)0x40040000))      // Low Power Timer Control Status Register (LPTMR0_CSR)
#define LPTMR0_PSR                    (*((volatile uint32_t *)0x40040004))      // Low Power Timer Prescale Register (LPTMR0_PSR)
#define LPTMR0_CMR                    (*((volatile uint32_t *)0x40040008))      // Low Power Timer Compare Register (LPTMR0_CMR)
#define LPTMR0_CNR                    (*((volatile uint32_t *)0x4004000C))      // Low Power Timer Counter Register (LPTMR0_CNR)


//*****************************************************************************
//
// Flex Controller Area Network (FlexCAN) registers
//
//*****************************************************************************

#define CAN_MCR                       (*((volatile uint32_t *)0x40024000))      // Module Configuration Register
#define CAN_CTRL1                     (*((volatile uint32_t *)0x40024004))      // Control 1 register
#define CAN_TIMER                     (*((volatile uint32_t *)0x40024008))      // Free Running Timer
#define CAN_RXMGMASK                  (*((volatile uint32_t *)0x40024010))      // Rx Mailboxes Global Mask Register
#define CAN_RX14MASK                  (*((volatile uint32_t *)0x40024014))      // Rx 14 Mask register
#define CAN_RX15MASK                  (*((volatile uint32_t *)0x40024018))      // Rx 15 Mask register
#define CAN_ECR                       (*((volatile uint32_t *)0x4002401C))      // Error Counter
#define CAN_ESR1                      (*((volatile uint32_t *)0x40024020))      // Error and Status 1 register
#define CAN_IMASK1                    (*((volatile uint32_t *)0x40024028))      // Interrupt Masks 1 register
#define CAN_IFLAG1                    (*((volatile uint32_t *)0x40024030))      // Interrupt Flags 1 register
#define CAN_CTRL2                     (*((volatile uint32_t *)0x40024034))      // Control 2 register
#define CAN_ESR2                      (*((volatile uint32_t *)0x40024038))      // Error and Status 2 register
#define CAN_CRCR                      (*((volatile uint32_t *)0x40024044))      // CRC Register
#define CAN_RXFGMASK                  (*((volatile uint32_t *)0x40024048))      // Rx FIFO Global Mask register
#define CAN_RXFIR                     (*((volatile uint32_t *)0x4002404C))      // Rx FIFO Information Register
#define CAN_CBT                       (*((volatile uint32_t *)0x40024050))      // CAN Bit Timing Register
#define CAN_RXIMR0                    (*((volatile uint32_t *)0x40024880))      // Rx Individual Mask Registers
#define CAN_RXIMR1                    (*((volatile uint32_t *)0x40024884))      // Rx Individual Mask Registers
#define CAN_RXIMR2                    (*((volatile uint32_t *)0x40024888))      // Rx Individual Mask Registers
#define CAN_RXIMR3                    (*((volatile uint32_t *)0x4002488C))      // Rx Individual Mask Registers
#define CAN_RXIMR4                    (*((volatile uint32_t *)0x40024890))      // Rx Individual Mask Registers
#define CAN_RXIMR5                    (*((volatile uint32_t *)0x40024894))      // Rx Individual Mask Registers
#define CAN_RXIMR6                    (*((volatile uint32_t *)0x40024898))      // Rx Individual Mask Registers
#define CAN_RXIMR7                    (*((volatile uint32_t *)0x4002489C))      // Rx Individual Mask Registers
#define CAN_RXIMR8                    (*((volatile uint32_t *)0x400248A0))      // Rx Individual Mask Registers
#define CAN_RXIMR9                    (*((volatile uint32_t *)0x400248A4))      // Rx Individual Mask Registers
#define CAN_RXIMR10                   (*((volatile uint32_t *)0x400248A8))      // Rx Individual Mask Registers
#define CAN_RXIMR11                   (*((volatile uint32_t *)0x400248AC))      // Rx Individual Mask Registers
#define CAN_RXIMR12                   (*((volatile uint32_t *)0x400248B0))      // Rx Individual Mask Registers
#define CAN_RXIMR13                   (*((volatile uint32_t *)0x400248B4))      // Rx Individual Mask Registers
#define CAN_RXIMR14                   (*((volatile uint32_t *)0x400248B8))      // Rx Individual Mask Registers
#define CAN_RXIMR15                   (*((volatile uint32_t *)0x400248BC))      // Rx Individual Mask Registers
#define CAN1_MCR                      (*((volatile uint32_t *)0x40025000))      // Module Configuration Register
#define CAN1_CTRL1                    (*((volatile uint32_t *)0x40025004))      // Control 1 register
#define CAN1_TIMER                    (*((volatile uint32_t *)0x40025008))      // Free Running Timer
#define CAN1_RXMGMASK                 (*((volatile uint32_t *)0x40025010))      // Rx Mailboxes Global Mask Register
#define CAN1_RX14MASK                 (*((volatile uint32_t *)0x40025014))      // Rx 14 Mask register
#define CAN1_RX15MASK                 (*((volatile uint32_t *)0x40025018))      // Rx 15 Mask register
#define CAN1_ECR                      (*((volatile uint32_t *)0x4002501C))      // Error Counter
#define CAN1_ESR1                     (*((volatile uint32_t *)0x40025020))      // Error and Status 1 register
#define CAN1_IMASK1                   (*((volatile uint32_t *)0x40025028))      // Interrupt Masks 1 register
#define CAN1_IFLAG1                   (*((volatile uint32_t *)0x40025030))      // Interrupt Flags 1 register
#define CAN1_CTRL2                    (*((volatile uint32_t *)0x40025034))      // Control 2 register
#define CAN1_ESR2                     (*((volatile uint32_t *)0x40025038))      // Error and Status 2 register
#define CAN1_CRCR                     (*((volatile uint32_t *)0x40025044))      // CRC Register
#define CAN1_RXFGMASK                 (*((volatile uint32_t *)0x40025048))      // Rx FIFO Global Mask register
#define CAN1_RXFIR                    (*((volatile uint32_t *)0x4002504C))      // Rx FIFO Information Register
#define CAN1_CBT                      (*((volatile uint32_t *)0x40025050))      // CAN Bit Timing Register
#define CAN1_RXIMR0                   (*((volatile uint32_t *)0x40025880))      // Rx Individual Mask Registers
#define CAN1_RXIMR1                   (*((volatile uint32_t *)0x40025884))      // Rx Individual Mask Registers
#define CAN1_RXIMR2                   (*((volatile uint32_t *)0x40025888))      // Rx Individual Mask Registers
#define CAN1_RXIMR3                   (*((volatile uint32_t *)0x4002588C))      // Rx Individual Mask Registers
#define CAN1_RXIMR4                   (*((volatile uint32_t *)0x40025890))      // Rx Individual Mask Registers
#define CAN1_RXIMR5                   (*((volatile uint32_t *)0x40025894))      // Rx Individual Mask Registers
#define CAN1_RXIMR6                   (*((volatile uint32_t *)0x40025898))      // Rx Individual Mask Registers
#define CAN1_RXIMR7                   (*((volatile uint32_t *)0x4002589C))      // Rx Individual Mask Registers
#define CAN1_RXIMR8                   (*((volatile uint32_t *)0x400258A0))      // Rx Individual Mask Registers
#define CAN1_RXIMR9                   (*((volatile uint32_t *)0x400258A4))      // Rx Individual Mask Registers
#define CAN1_RXIMR10                  (*((volatile uint32_t *)0x400258A8))      // Rx Individual Mask Registers
#define CAN1_RXIMR11                  (*((volatile uint32_t *)0x400258AC))      // Rx Individual Mask Registers
#define CAN1_RXIMR12                  (*((volatile uint32_t *)0x400258B0))      // Rx Individual Mask Registers
#define CAN1_RXIMR13                  (*((volatile uint32_t *)0x400258B4))      // Rx Individual Mask Registers
#define CAN1_RXIMR14                  (*((volatile uint32_t *)0x400258B8))      // Rx Individual Mask Registers
#define CAN1_RXIMR15                  (*((volatile uint32_t *)0x400258BC))      // Rx Individual Mask Registers


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

