MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV46F256VLL16Q/mcu.h
#define SPI0_MCR                      (*((volatile uint32_t *)0x4002C000))      // Module Configuration Register
#define SPI0_TCR                      (*((volatile uint32_t *)0x4002C008))      // Transfer Count Register
#define SPI0_CTAR0                    (*((volatile uint32_t *)0x4002C00C))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI0_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002C00C))      // Clock and Transfer Attributes Register (In Slave Mode)
#define SPI0_CTAR1                    (*((volatile uint32_t *)0x4002C010))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI0_SR                       (*((volatile uint32_t *)0x4002C02C))      // Status Register
#define SPI0_RSER                     (*((volatile uint32_t *)0x4002C030))      // DMA/Interrupt Request Select and Enable Register
#define SPI0_PUSHR                    (*((volatile uint32_t *)0x4002C034))      // PUSH TX FIFO Register In Master Mode
#define SPI0_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002C034))      // PUSH TX FIFO Register In Slave Mode
#define SPI0_POPR                     (*((volatile uint32_t *)0x4002C038))      // POP RX FIFO Register
#define SPI0_TXFR0                    (*((volatile uint32_t *)0x4002C03C))      // Transmit FIFO Registers
#define SPI0_TXFR1                    (*((volatile uint32_t *)0x4002C040))      // Transmit FIFO Registers
#define SPI0_TXFR2                    (*((volatile uint32_t *)0x4002C044))      // Transmit FIFO Registers
#define SPI0_TXFR3                    (*((volatile uint32_t *)0x4002C048))      // Transmit FIFO Registers
#define SPI0_RXFR0                    (*((volatile uint32_t *)0x4002C07C))      // Receive FIFO Registers
#define SPI0_RXFR1                    (*((volatile uint32_t *)0x4002C080))      // Receive FIFO Registers
#define SPI0_RXFR2                    (*((volatile uint32_t *)0x4002C084))      // Receive FIFO Registers
#define SPI0_RXFR3                    (*((volatile uint32_t *)0x4002C088))      // Receive FIFO Registers


//*****************************************************************************
//
// Inter-Integrated Circuit (I2C) registers
//
//*****************************************************************************

#define I2C0_A1                       (*((volatile uint32_t *)0x40066000))      // I2C Address Register 1 (I2C0_A1)
#define I2C0_F                        (*((volatile uint32_t *)0x40066001))      // I2C Frequency Divider register (I2C0_F)
#define I2C0_C1                       (*((volatile uint32_t *)0x40066002))      // I2C Control Register 1 (I2C0_C1)
#define I2C0_S                        (*((volatile uint32_t *)0x40066003))      // I2C Status register (I2C0_S)
#define I2C0_D                        (*((volatile uint32_t *)0x40066004))      // I2C Data I/O register (I2C0_D)
#define I2C0_C2                       (*((volatile uint32_t *)0x40066005))      // I2C Control Register 2 (I2C0_C2)
#define I2C0_FLT                      (*((volatile uint32_t *)0x40066006))      // I2C Programmable Input Glitch Filter Register (I2C0_FLT)
#define I2C0_RA                       (*((volatile uint32_t *)0x40066007))      // I2C Range Address register (I2C0_RA)
#define I2C0_SMB                      (*((volatile uint32_t *)0x40066008))      // I2C SMBus Control and Status register (I2C0_SMB)
#define I2C0_A2                       (*((volatile uint32_t *)0x40066009))      // I2C Address Register 2 (I2C0_A2)
#define I2C0_SLTH                     (*((volatile uint32_t *)0x4006600A))      // I2C SCL Low Timeout Register High (I2C0_SLTH)
#define I2C0_SLTL                     (*((volatile uint32_t *)0x4006600B))      // I2C SCL Low Timeout Register Low (I2C0_SLTL)


//*****************************************************************************
//
// Universal Asynchronous Receiver/Transmitter (UART) / FlexSCI registers
//
//*****************************************************************************

#define UART0_BDH                     (*((volatile uint32_t *)0x4006A000))      // Baud Rate Registers: High
#define UART0_BDL                     (*((volatile uint32_t *)0x4006A001))      // Baud Rate Registers: Low
#define UART0_C1                      (*((volatile uint32_t *)0x4006A002))      // Control Register 1
#define UART0_C2                      (*((volatile uint32_t *)0x4006A003))      // Control Register 2
#define UART0_S1                      (*((volatile uint32_t *)0x4006A004))      // Status Register 1
#define UART0_S2                      (*((volatile uint32_t *)0x4006A005))      // Status Register 2
#define UART0_C3                      (*((volatile uint32_t *)0x4006A006))      // Control Register 3
#define UART0_D                       (*((volatile uint32_t *)0x4006A007))      // Data Register
#define UART0_MA1                     (*((volatile uint32_t *)0x4006A008))      // Match Address Registers 1
#define UART0_MA2                     (*((volatile uint32_t *)0x4006A009))      // Match Address Registers 2
#define UART0_C4                      (*((volatile uint32_t *)0x4006A00A))      // Control Register 4
#define UART0_C5                      (*((volatile uint32_t *)0x4006A00B))      // Control Register 5
#define UART0_ED                      (*((volatile uint32_t *)0x4006A00C))      // Extended Data Register
#define UART0_MODEM                   (*((volatile uint32_t *)0x4006A00D))      // Modem Register
#define UART0_PFIFO                   (*((volatile uint32_t *)0x4006A010))      // FIFO Parameters
#define UART0_CFIFO                   (*((volatile uint32_t *)0x4006A011))      // FIFO Control Register
#define UART0_SFIFO                   (*((volatile uint32_t *)0x4006A012))      // FIFO Status Register
#define UART0_TWFIFO                  (*((volatile uint32_t *)0x4006A013))      // FIFO Transmit Watermark
#define UART0_TCFIFO                  (*((volatile uint32_t *)0x4006A014))      // FIFO Transmit Count
#define UART0_RWFIFO                  (*((volatile uint32_t *)0x4006A015))      // FIFO Receive Watermark
#define UART0_RCFIFO                  (*((volatile uint32_t *)0x4006A016))      // FIFO Receive Count
#define UART1_BDH                     (*((volatile uint32_t *)0x4006B000))      // Baud Rate Registers: High
#define UART1_BDL                     (*((volatile uint32_t *)0x4006B001))      // Baud Rate Registers: Low
#define UART1_C1                      (*((volatile uint32_t *)0x4006B002))      // Control Register 1
#define UART1_C2                      (*((volatile uint32_t *)0x4006B003))      // Control Register 2
#define UART1_S1                      (*((volatile uint32_t *)0x4006B004))      // Status Register 1
#define UART1_S2                      (*((volatile uint32_t *)0x4006B005))      // Status Register 2
#define UART1_C3                      (*((volatile uint32_t *)0x4006B006))      // Control Register 3
#define UART1_D                       (*((volatile uint32_t *)0x4006B007))      // Data Register
#define UART1_MA1                     (*((volatile uint32_t *)0x4006B008))      // Match Address Registers 1
#define UART1_MA2                     (*((volatile uint32_t *)0x4006B009))      // Match Address Registers 2
#define UART1_C4                      (*((volatile uint32_t *)0x4006B00A))      // Control Register 4
#define UART1_C5                      (*((volatile uint32_t *)0x4006B00B))      // Control Register 5
#define UART1_ED                      (*((volatile uint32_t *)0x4006B00C))      // Extended Data Register
#define UART1_MODEM                   (*((volatile uint32_t *)0x4006B00D))      // Modem Register
#define UART1_PFIFO                   (*((volatile uint32_t *)0x4006B010))      // FIFO Parameters
#define UART1_CFIFO                   (*((volatile uint32_t *)0x4006B011))      // FIFO Control Register
#define UART1_SFIFO                   (*((volatile uint32_t *)0x4006B012))      // FIFO Status Register
#define UART1_TWFIFO                  (*((volatile uint32_t *)0x4006B013))      // FIFO Transmit Watermark
#define UART1_TCFIFO                  (*((volatile uint32_t *)0x4006B014))      // FIFO Transmit Count
#define UART1_RWFIFO                  (*((volatile uint32_t *)0x4006B015))      // FIFO Receive Watermark
#define UART1_RCFIFO                  (*((volatile uint32_t *)0x4006B016))      // FIFO Receive Count


//*****************************************************************************
//
// General-Purpose Input/Output (GPIO) registers
//
//*****************************************************************************

#define GPIOA_PDOR                    (*((volatile uint32_t *)0x400FF000))      // Port Data Output Register
#define GPIOA_PSOR                    (*((volatile uint32_t *)0x400FF004))      // Port Set Output Register
#define GPIOA_PCOR                    (*((volatile uint32_t *)0x400FF008))      // Port Clear Output Register
#define GPIOA_PTOR                    (*((volatile uint32_t *)0x400FF00C))      // Port Toggle Output Register
#define GPIOA_PDIR                    (*((volatile uint32_t *)0x400FF010))      // Port Data Input Register
#define GPIOA_PDDR                    (*((volatile uint32_t *)0x400FF014))      // Port Data Direction Register
#define GPIOB_PDOR                    (*((volatile uint32_t *)0x400FF040))      // Port Data Output Register
#define GPIOB_PSOR                    (*((volatile uint32_t *)0x400FF044))      // Port Set Output Register
#define GPIOB_PCOR                    (*((volatile uint32_t *)0x400FF048))      // Port Clear Output Register
#define GPIOB_PTOR                    (*((volatile uint32_t *)0x400FF04C))      // Port Toggle Output Register
#define GPIOB_PDIR                    (*((volatile uint32_t *)0x400FF050))      // Port Data Input Register
#define GPIOB_PDDR                    (*((volatile uint32_t *)0x400FF054))      // Port Data Direction Register
#define GPIOC_PDOR                    (*((volatile uint32_t *)0x400FF080))      // Port Data Output Register
#define GPIOC_PSOR                    (*((volatile uint32_t *)0x400FF084))      // Port Set Output Register
#define GPIOC_PCOR                    (*((volatile uint32_t *)0x400FF088))      // Port Clear Output Register
#define GPIOC_PTOR                    (*((volatile uint32_t *)0x400FF08C))      // Port Toggle Output Register
#define GPIOC_PDIR                    (*((volatile uint32_t *)0x400FF090))      // Port Data Input Register
#define GPIOC_PDDR                    (*((volatile uint32_t *)0x400FF094))      // Port Data Direction Register
#define GPIOD_PDOR                    (*((volatile uint32_t *)0x400FF0C0))      // Port Data Output Register
#define GPIOD_PSOR                    (*((volatile uint32_t *)0x400FF0C4))      // Port Set Output Register
#define GPIOD_PCOR                    (*((volatile uint32_t *)0x400FF0C8))      // Port Clear Output Register
#define GPIOD_PTOR                    (*((volatile uint32_t *)0x400FF0CC))      // Port Toggle Output Register
#define GPIOD_PDIR                    (*((volatile uint32_t *)0x400FF0D0))      // Port Data Input Register
#define GPIOD_PDDR                    (*((volatile uint32_t *)0x400FF0D4))      // Port Data Direction Register
#define GPIOE_PDOR                    (*((volatile uint32_t *)0x400FF100))      // Port Data Output Register
#define GPIOE_PSOR                    (*((volatile uint32_t *)0x400FF104))      // Port Set Output Register
#define GPIOE_PCOR                    (*((volatile uint32_t *)0x400FF108))      // Port Clear Output Register
#define GPIOE_PTOR                    (*((volatile uint32_t *)0x400FF10C))      // Port Toggle Output Register
#define GPIOE_PDIR                    (*((volatile uint32_t *)0x400FF110))      // Port Data Input Register
#define GPIOE_PDDR                    (*((volatile uint32_t *)0x400FF114))      // Port Data Direction Register

